def classify_meal_type(food_name, description):
    breakfast_keywords = [
        'بيض', 'شوفان', 'توست', 'زبادي', 'فواكه', 'عسل', 'كريب', 'بريوش',
        'حليب', 'لبن', 'فطور', 'بانكيك', 'مربى', 'شاي', 'قهوة', 'جبنة', 
        'موز', 'تفاح', 'تمر', 'عصير', 'لبنة', 'فول', 'حمص', 'جبنة قريش',
        'عسل نحل', 'زبادي قليل الدسم', 'شوفان مطبوخ', 'مكرونة', 'بطاطا', 'فطير',
        'كعك', 'سمبوسة جبنة', 'سمبوسة لحم'
    ]
    lunch_keywords = [
        'دجاج', 'لحم', 'سمك', 'رز', 'مكرونة', 'عدس', 'حمص', 'فول', 'كشري',
        'محشي', 'صينية', 'شوربة', 'سلطة', 'غداء', 'طاجن', 'مشوي', 'مسلوق',
        'كوارع', 'كبده', 'قلب', 'مخ', 'عكاوي'
    ]
    dinner_keywords = [
        'سمك', 'دجاج', 'لحم', 'سلطة', 'خضار', 'شوربة', 'فاصوليا', 'عشاء',
        'مقلية', 'مشوي', 'مسلوق', 'طاجن', 'كوارع', 'مخ', 'كبدة', 'جمبري',
        'طعام ثقيل'
    ]
    snack_keywords = [
        'تفاح', 'موز', 'تمر', 'مكسرات', 'زبادي', 'فواكه', 'عسل', 'بسكويت',
        'شاي', 'قهوة', 'سناك', 'خضروات', 'ماء', 'عصير', 'مكسرات', 'لوز', 'كاجو',
        'فستق', 'زبادي قليل الدسم'
    ]

    text = (food_name + ' ' + description).lower()

    for word in breakfast_keywords:
        if word in text:
            return 'فطور'

    for word in lunch_keywords:
        if word in text:
            return 'غداء'

    for word in dinner_keywords:
        if word in text:
            return 'عشاء'

    for word in snack_keywords:
        if word in text:
            return 'سناك'

    return 'سناك'  # افتراضياً
